
#include <stdio.h> необходимо для корректного вызова функций ввода/вывода
int main()
{
<<<<<<< HEAD
	int a, cnt = 0, k = 0 ; // ввод текущего символа из потока, счетчика букв, счетчика нечетных букв
	float b; // остаток от деления
	while ((a = getchar()) != EOF) // цикл чтения символов из потока, связанного с клавиатурой
	{
		if (a == ' ' || a == '.' || a == '\n' || a == ',') // если найден разделитель, проверить...
		{
			b = cnt % 2;
			if (b == 1) // если остаток от деления 1, значит слово нечет, тогда...
			{
				k++;
			}
			cnt = 0; // т.к. слово закончилось, обнуляем счетчик букв в слове
		}
		else
		{
			cnt++;
		}
	}
	printf("number of odd words=%d\n", k); // вывод счетчика нечетных слов
	getchar();
	return 0;
=======
int a; // С‚РµРєСѓС‰РёР№ СЃРёРјРІРѕР» РёР· РїРѕС‚РѕРєР°
int cnt; // СЃС‡РµС‚С‡РёРє Р±СѓРєРІ
int k; // СЃС‡РµС‚С‡РёРє РЅРµС‡РµС‚РЅС‹С… Р±СѓРєРІ
float b; // РѕСЃС‚Р°С‚РѕРє РѕС‚ РґРµР»РµРЅРёСЏ
cnt = 0;
k = 0;
while ((a = getchar()) != EOF) // С†РёРєР» С‡С‚РµРЅРёСЏ СЃРёРјРІРѕР»РѕРІ РёР· РїРѕС‚РѕРєР°, СЃРІСЏР·Р°РЅРЅРѕРіРѕ СЃ РєР»Р°РІРёР°С‚СѓСЂРѕР№
{
if (a == ' ' || a == '.' || a == '\n' || a == ',') // РµСЃР»Рё РЅР°Р№РґРµРЅ СЂР°Р·РґРµР»РёС‚РµР»СЊ, РїСЂРѕРІРµСЂРёС‚СЊ...
{
b = cnt % 2;
if (b == 1) // РµСЃР»Рё РѕСЃС‚Р°С‚РѕРє РѕС‚ РґРµР»РµРЅРёСЏ 1, Р·РЅР°С‡РёС‚ СЃР»РѕРІРѕ РЅРµС‡РµС‚, С‚РѕРіРґР°...
{
k++;
}
cnt = 0; // С‚.Рє. СЃР»РѕРІРѕ Р·Р°РєРѕРЅС‡РёР»РѕСЃСЊ, РѕР±РЅСѓР»СЏРµРј СЃС‡РµС‚С‡РёРє Р±СѓРєРІ РІ СЃР»РѕРІРµ
}
else
{
cnt++;
}
}
printf("number of odd words=%d\n", k); // РІС‹РІРѕРґ СЃС‡РµС‚С‡РёРєР° РЅРµС‡РµС‚РЅС‹С… СЃР»РѕРІ
getchar();
return 0;
>>>>>>> 72ceef2fcdd69e858f3a6ffd269170143e48d668
}
